import React from "react";
import styles from "./About.module.css";

export const About = () => {
    return (
        <div className={styles.aboutContainer}>
            <h1 className={styles.aboutTitle}>Про нас</h1>
            <p className={styles.aboutText}>
                Ласкаво просимо до нашого застосунку для перегляду фільмів! Цей застосунок дозволяє користувачам 
                досліджувати широкий вибір фільмів, переглядати детальну інформацію про них та відкривати нові 
                улюблені стрічки. Наша місія — створити зручний та приємний досвід для всіх любителів кіно.
            </p>
            <p className={styles.aboutText}>
                Наша команда захоплена фільмами та технологіями, і ми постійно працюємо над покращенням 
                застосунку, щоб приносити вам найновіші функції та вдосконалення. Сподіваємось, ви отримаєте 
                задоволення від використання нашого застосунку так само, як ми отримували задоволення від його 
                створення!
            </p>
            <h2 className={styles.featuresTitle}>Основні функції</h2>
            <ul className={styles.featuresList}>
                <li>Широкий вибір фільмів з можливістю перегляду деталей</li>
                <li>Зручна система пагінації для легкого навігації</li>
                <li>Сучасний та інтуїтивно зрозумілий інтерфейс</li>
                <li>Можливість фільтрації та сортування фільмів</li>
            </ul>
            <p className={styles.aboutText}>
                Ми завжди відкриті до ваших відгуків і пропозицій! Якщо у вас є питання або ідеї, 
                не соромтеся зв’язатися з нами.
            </p>
        </div>
    );
};
